{
  "blogs": [
    {
      "title": "BMC demolishes \"unauthorized\" interiors of Anil Kapoor's office",
      "author": "Guest Author",
      "content": "The latest star to face heat from the Mumbai civic body, the BMC, is Bollywood actor, Anil Kapoor. Allegedly, \"unauthorized\" glass-and-wood cabins along with cubicles built inside the actor’s Santacruz West office, was demolished by the civic body.\n\nAccording to reports, the BMC's H-West Ward staff razed unauthorized interior work allegedly carried out at four premises in Savoy Chambers, including the actor's 2,500-square-foot office. A notice was served on the four offices under the Maharashtra Regional and Town Planning Act (MRTP) 1956, over the interior works.\n\nSharad Ughade, the assistant municipal commissioner, H-West Ward, said to the Times of India, \"Four structures were partly demolished following due process of law. Besides, a car showroom on the second floor that was issued a stop-work notice was razed too.\" He said Kapoor's office had unauthorized \"full height partitions. These can be regularized but no application was made to the BMC for it,\" he added.\n\nOn the work front, Anil Kapoor is shooting for 'Fanney Khan' alongside Aishwarya Rai Bachchan and Rajkummar Rao.",
      "date": "2017-11-28T07:06:14.784Z",
      "category": 3,
      "id": 1
    },
    {
      "title": "Impact of Ben Stokes' absence laid bare in England's Gabba defeat",
      "author": "Guest Author",
      "content": "England did their best to shrug off the omission of Ben Stokes from the Ashes tour squad but the world class all-rounder's absence was felt keenly by the tourists in their crushing 10-wicket defeat by Australia at the Gabba.\n\nStokes has been suspended since he was arrested on suspicion of causing actual bodily harm outside a Bristol nightclub in September and police continue to investigate the incident.\n\nNews that Stokes had flown to New Zealand, his country of birth, fanned speculation he could be set for a recall, despite England's cricket board saying the trip was \"private\" and not Ashes-related.\n\nAustralian media, however, suspect it could be part of a plan to parachute him into the team for the third Test in Perth if the result of the police investigation comes out beforehand.\n\nFor all the headlines and attention a Stokes recall might generate, England would likely welcome him back with open arms, particularly after their struggles with bat and ball in the series-opener in Brisbane.\n\nFor two days at the Gabba, however, Stokes's absence seemed as if it would be nothing more than a footnote to the grander story of the first Test.\nEngland's rookie batsmen Mark Stoneman, James Vince and Dawid Malan, repelled Australia's much vaunted pace attack to post half-centuries and drive their team to a first innings 302.\n\nIt was a total, paceman Stuart Broad noted, England would have taken \"any day of the week\" at the Gabba, where no English side has come out on top since Mike Gatting's team in 1986.\n",
      "date": "2017-11-28T07:07:11.716Z",
      "category": 1,
      "id": 2
    },
    {
      "title": "Hopefully Ravichandran Ashwin will finish with 500 to 600 Test wickets: Sourav Ganguly to India Today",
      "author": "Guest Author",
      "content": "Former India captain Sourav Ganguly backed ace off-spinner Ravichandran Ashwin to play 100 Test matches and finish with 500 to 600 wickets in the longest format.\nAshwin, who on Monday, beat Australia legend Dennis Lillee's record to become the fastest to reach the 300-wicket mark in Test cricket, starred in India's innings and 239-run victory against Sri Lanka in Nagpur. He finished with eight wickets for 130 runs in the second Test at Nagpur, picking up a four-wicket haul in each innings.\nTalking to India Today, Ganguly said that Ashwin is on top of his game and he thinks the Tamil Nadu tweaker will end up with more than 500 wickets when he finishes his career.\n\n\"It's a fantastic achievement in 50-odd Test matches. 300 wickets in 54 Test matches is a phenomenal record. Congratulations to him. He will go on to play 100 Test matches for India without a doubt and he can finish with 500-600 Test wickets. So it's a remarkable achievement,\" Ganguly said.\n",
      "date": "2017-11-28T07:07:26.940Z",
      "category": 1,
      "id": 3
    },
    {
      "title": "Android 8.1 Developer Preview 2 Now Available, Enables Pixel Visual Core SoC ",
      "author": "Guest Author",
      "content": "Google on Monday started rolling out Android 8.1 Developer Preview 2 for compatible Pixel and Nexus devices. The final preview is available for the entire hardware range that received the original Android Oreo update earlier this year, including Nexus 5X, Nexus 6P, Pixel C, Pixel, Pixel XL, Pixel 2, and Pixel 2 XL. Amongst other features, the new version enables the Pixel Visual Core coprocessor, which boosts the image signal processing on the smartphone.\n\nFollowing the launch of the Pixel 2 and Pixel 2 XL back in October, Google revealed the smartphones featured a Pixel Visual Core chip that it had designed in partnership with Intel. The new chip is specifically designed to enhance the existing image-taking experience on the new Pixel handsets using machine learning and artificial intelligence (AI) efforts. Although the chip has existed on the Pixel 2 models since their arrival, the Mountain View, California-headquartered has finally enabled its experience through the new developer preview build.\n\nDevelopers will be able to leverage to the presence of Pixel Visual Core to offer HDR+ shots on their apps, using the Android Camera API. This means that third-party apps would be able to deliver an experience close to the default camera app on the Pixel 2 models.\n\nIn addition to the Pixel Visual Core advancement, the Android 8.1 Developer Preview 2 includes \"near-final\" Android 8.1 system images for Pixel and Nexus devices along with official APIs (API level 27), latest optimisations and bug fixes, and the November 2017 security updates. There is also Neural Networks API that accelerates computation and inference for on-device machine learning frameworks like TensorFlow Lite and Caffe2 among others. Additionally, the new developer preview includes a Shared Memory API for lower-end hardware with 1GB or less RAM.\n\nIf you've already enrolled in the Android Beta Program, you'll soon receive an update notification to download the new preview through an over-the-air (OTA) package. However, you can also flash your Pixel or Nexus device manually by installing a compatible factory image. Factory images for all supported devices are available for download on Android Developers' site.\n\nIn case you don't want to install the developer preview, anticipating the public release of Android 8.1, you will need to wait for few weeks. The official launch of the new Android version is due in December, Google says. It will include all the features of the first and second developer previews as well as enhancements such as an 'SMS Connect' for Chromebooks and a space-saving tweak.\n\n",
      "date": "2017-11-28T07:06:24.228Z",
      "category": 2,
      "id": 4
    },
    {
      "title": "'Padmavati': Kapil Sharma condemns death threats\n\n",
      "author": "Guest Author",
      "content": "Comedian-turned-actor Kapil Sharma addressing the ongoing controversy surrounding 'Padmavati' condemned the death threats being issued against the cast of the movie.\n\nWhile talking to ANI, the stand-up comedian, who was in the national capital as part of 'Firangi' promotions, said that those who are protesting against the film too have right to express their opinions, but death threats should not be given.\n\"Nobody has seen the 'Padmavati' yet and I feel Censor Board is there is to look up into the matter. If there is anything objectable, then the board keeping in mind the sentiments of people, should remove it. I strongly condemn death threats given to artists. Artists are not at any fault, they just do their work, he said.\n\n'The Kapil Sharma' show host added, \"But everyone has the right to express their opinions. Those who feel that the film has hurt their sentiments, have the right to express their opinions but death threats should not be given.\"\nFor the unversed, the supporters of Karni Sena announced a reward for beheading Padmavati's director Sanjay Leela Bhansali and the film's leading lady Deepika Padukone.\n\nBhansali's magnum opus 'Padmavati' has been in the eye of the storm following protests from various conservative groups over alleged tampering with historical facts, a contention which filmmaker Bhansali has denied repeatedly.\n\nThe release of the film, which was earlier slated for December 1, was deferred as the filmmakers were yet to procure a censor certificate.\n",
      "date": "2017-11-28T07:01:13.027Z",
      "category": 3,
      "id": 5
    },
    {
      "title": "OnePlus 5T goes on open sale in India via Amazon, OnePlus store: Check out the full details\n",
      "author": "Guest Author",
      "content": "OnePlus 5T has officially gone on sale via Amazon India today. OnePlus 5T’s price in India is Rs 32,999 for the base 6GB RAM variant, while the top-end 8GB RAM model costs Rs 37,999. OnePlus 5T is Amazon exclusive in India, and will also be made available on the OnePlus’ official online store. The high-end phone was first launched on November 16 in New York. The phone will be available only in one colour option  – Midnight Black.\n\nAs for launch offers, those who buy OnePlus 5T will get 1008GB data for 18 months from Idea, Rs 500 promotion credit for Kindle books, Rs 250 as Amazon Pay balance to users who stream on their Prime Video app, and free 12 month Damage Insurance by Servify .Moreover, HDFC Bank debit and credit cards users are eligible for a Rs 1,500 instant discount on purchase of OnePlus 5T through Amazon India till December 2017.\n\nAdditionally, OnePlus has introduced something called the  Referral Leaderboard in India for the first time which will be valid from November 21 to November 30. It essentially provides  Rs 1,000 off on accessories, with the purchase of OnePlus smartphone from oneplusstore.in.\n\nOnePlus 5T went on sale in India on November 21. The Chinese company said it sold out the device within five minutes of the special one-hour preview sale. The flagship phone is a refreshed version of the original OnePlus 5, which was launched in June this year. Perhaps the talking point of the OnePlus 5T is the 6-inch FHD+ 18:9 display. The phone continues to feature the same Snapdragon 835 processor and a 3300mAh battery as the OnePlus 5. However, for a change, it gets a Face Unlock feature which let users to unlock the phone just by looking at the device. OnePlus 5T runs Android 7.1 Nougat, though the company claims the phone will be updated to Android Oreo early next year.\n\nThe main rear camera features a 16MP sensor while the secondary rear camera is using an 20MP sensor. There is dual LED flash on the back and the camera can record video at up to 4K resolution. Although the OnePlus 5T features the same main camera sensor as the OnePlus 5, it now offers improved secondary camera shooter with a large f/1.7 aperture for superior “low light photography”. The front camera has a 16MP resolution.\n",
      "date": "2017-11-28T07:03:23.611Z",
      "category": 2,
      "id": 6
    }
  ]
}